class Name_Random:
    def __init__ (self):
        pass
    
    
    # -----------------------------------------------------------------------------------------------------------------------------------------------------
    
    
    def name_random(self,index):
        index = index - 1
        name_list = ['ธาวัน ตั้งตระกูลเจริญ','ปิติพงศ์ ชนะสมบัติ','ปิติวัฒน์ ธนากานต์','ภัคธีมา ศิริวงศ์สกุลชัย','นรียา จันทรสมบูรณ์','นันทิพร สุขประเสริญ','กิตติญา คมมาก','กรรณิกา วงวิไล','อัมพิกา วงศ์เจริญ',
                     'เศรษฐา สุรศักดิ์อุดม','นิชาภรณ์ ชาติสมบัติ','พัฒนกิจ เผ่ารอด','นโรตม์ พิกุลเทพ','ขวัญรัตน์ กลิ่นเพชร','กนกนุช มาลัยแก้ว','พลาธร พรมบุตร','โสธร มหาเมธี','พงศ์พิสุทธิ์ ลายศรี',
                     'พรพิมล โอภาสพัฒน์','ปรียาดา สันติสุข','จันทรัตว์ จงจำรัส','ฉัตรธร พุ่มสนธิ','พิมพ์ภา เสนาวงศ์','ชญานี วัฒนศักดิ์มนตรี','กันสิตา รัตนพิรมย์','กนิษฐา เผ่ารอด',
                     'ฐิตา ธรรมภักดิ์','กลวัชร วัชรกิจ','เดชวิทย์ สุวรรณศิริ']
        
        name = name_list[index]
        
        return name